---
layout: post
title: Prosjektmetode for utvikling av apps
description: Agile og LEAN tilnærming til apputvikling.
---
<p><em>Vi har noen enkle prinsipper vi f&oslash;lger n&aring;r vi starter et utviklingsprosjekt. Her finner du noen kjerneområder:</em></p>

<h2>Agile produktutvikling</h2>

<p>Vi er opptatt av &aring; starte ut med en god og grundig kravspesifikasjon. Like full anerkjenner vi at ingen kunder er i stand til &aring; skrive en perfekt spec! Derfor m&aring; vi i stedet formulere et sett med &quot;user stories&quot;, og prioritere blant disse innen det budsjettet som er tilgjengelig. M&aring;let er &aring; f&aring; det beste resultatet! Forvirret? Ta en titt p&aring; denne videoen, og spiss pennen. Her er mye visdom:</p>
<br>

<p><iframe allowfullscreen="" frameborder="0" height="445" src="http://www.youtube.com/embed/502ILHjX9EE" width="770"></iframe></p>

<p>&nbsp;</p>

<h2>LEAN Startup</h2>

<p>Etter at Eric Ries lanserte LEAN Startup i 2009, har markedsrettede IT-prosjekter endret karakter. App -og web bransjen er i stadig bevegelse, og det viktigste sp&oslash;rsm&aring;let n&aring;r man skal lage en app er ikke lenger &quot;blir den ferdig til tiden?&quot; eller &quot;klarer vi busjettet?&quot;. Det viktigste sp&oslash;rsm&aring;let er: Lager vi riktig produkt? Dersom man lager et produkt ingen vil ha, spiller andre hensyn mindre rolle.&nbsp;</p>

<p>De viktigste prinsippene &aring; ta med seg fra LEAN startup, er f&oslash;lgende:</p>

<ul>
  <li>Formulere leap-of-faith antakelser. Hvilke antakelser gj&oslash;r du deg om produktet og markedet, og hvilke av disse er kritiske?</li>
  <li>Lage et minimumsprodukt. Hvor lite kan produktet v&aelig;re for at du skal kunne l&aelig;re av markedets respons og bruk?</li>
  <li>V&aelig;r i dialog med markedet -alltid</li>
  <li>Gj&oslash;r eksperimenter for &aring; teste hypoteser</li>
</ul>

<p>Vi har skrevet en bloggpost som oppsummerer de viktigste LEAN-prinsippene her: <a href="http://www.frontkom.no/blogg/lean">LEAN Startup summary</a></p>

<h2>Prosjektledelse</h2>

<p>Noen viktige omr&aring;der for oss:</p>

<ul>
  <li>God og jevnlig kommunikasjon; gjerne daglige &quot;standups&quot;</li>
  <li>Gode prosjektverkt&oslash;y (vi bruker Target Process, Github og Basecamp)</li>
  <li>Trygghet: Vi oppdaterer kunden p&aring; hva vi jobber med, og hvordan vi ligger an</li>
  <li>Alle involverte skal ha en god forst&aring;else av sluttproduktet, og hva det skal utrette</li>
</ul>

<hr>
